result/result_probably_consolidated/c8220(ivy)_consolidated_4core_8iothread_1/delay_0/run3.txt
# run=3/10
# 2026-04-06T00:02:14-06:00
# cmd: taskset -c 1-39 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            15008
        write:                           3908
        other:                           2006
        total:                           20922
    transactions:                        934    (15.01 per sec.)
    queries:                             20922  (336.30 per sec.)
    ignored errors:                      138    (2.22 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      15.0130
    time elapsed:                        62.2127s
    total number of events:              934

Latency (ms):
         min:                                   59.30
         avg:                                 2095.06
         max:                                 7475.58
         95th percentile:                     4437.27
         sum:                              1956781.81

Threads fairness:
    events (avg/stddev):           29.1875/3.24
    execution time (avg/stddev):   61.1494/0.66